tutorialsDyM/2DOscillatoryDisk/system/funkySetFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
expressions
 (

       alpha
        {
        field alpha.a; //field to initialise
        fields
        (
        z alpha
        );
        lookuptables (
        {
        name inletprofilealpha;
        outOfBounds clamp;
        file "$FOAM_CASE/1d_profil/alpha.a.xy";
        }
        );
        expression "inletprofilealpha(pos().y)";
        keepPatches 1;
        }


 );
